UT_Marketplaces.Marketplaces/src/DataProcessors/рар_мп_ПодготовкаФайловПоставки_ПодборНоменклатуры/рар_мп_ПодготовкаФайловПоставки_ПодборНоменклатуры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>рар_мп_ПодготовкаФайловПоставки_ПодборНоменклатуры</name>
  <tabularSections>
    <name>Номенклатура</name>
    <attributes>
      <name>Аккаунт</name>
      <type>
        <types>CatalogRef.рар_мп_АккаунтыМаркетплейсов</types>
      </type>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Артикул</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Упаковка</name>
      <type>
        <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоОстаток</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоОстатокОбщее</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ВыбранныеТовары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Артикул</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Упаковка</name>
      <type>
        <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:DataProcessor>

UT_Marketplaces.Marketplaces/src/InformationRegisters/рар_мп_Ozon_СопоставленныеТовары/рар_мп_Ozon_СопоставленныеТовары.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>рар_мп_Ozon_СопоставленныеТовары</name>
  <resources>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </resources>
  <resources>
    <name>Характеристика</name>
    <type>
      <types>CatalogRef.ХарактеристикиНоменклатуры</types>
    </type>
  </resources>
  <resources>
    <name>Упаковка</name>
    <type>
      <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
    </type>
  </resources>
  <attributes>
    <name>НаименованиеТовара</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>Аккаунт</name>
    <type>
      <types>CatalogRef.рар_мп_АккаунтыМаркетплейсов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Артикул</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>IDТовара</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>30</precision>
      </numberQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>SKUТовара</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

UT_Marketplaces.Marketplaces/src/AccumulationRegisters/ТоварыНаСкладах/ТоварыНаСкладах.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="80440cbb-f97b-4620-8eca-b89f9a033f08">
  <name>ТоварыНаСкладах</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <registerType>Checked</registerType>
  </extension>
  <resources extendedConfigurationObject="2d1fe73e-1f3d-4ee9-9dd1-010dfff742b1">
    <name>ВНаличии</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <dimensions extendedConfigurationObject="70b08d50-30e9-4115-9e39-67ef989c58b2">
    <name>Номенклатура</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="c9fd5a1a-3aa5-4048-b15e-f8b6a41ab96f">
    <name>Характеристика</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="29d5a4e7-4544-4ed2-a8bf-d541eef13703">
    <name>Склад</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
</mdclass:AccumulationRegister>

UT_Marketplaces.Marketplaces/src/InformationRegisters/рар_мп_ЯндексМаркет_СопоставленныеТовары/рар_мп_ЯндексМаркет_СопоставленныеТовары.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>рар_мп_ЯндексМаркет_СопоставленныеТовары</name>
  <resources>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </resources>
  <resources>
    <name>Характеристика</name>
    <type>
      <types>CatalogRef.ХарактеристикиНоменклатуры</types>
    </type>
  </resources>
  <resources>
    <name>Упаковка</name>
    <type>
      <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
    </type>
  </resources>
  <attributes>
    <name>НаименованиеТовара</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>SKUЯндексМаркета</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>Аккаунт</name>
    <type>
      <types>CatalogRef.рар_мп_АккаунтыМаркетплейсов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>SKUТовара</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Артикул</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

UT_Marketplaces.Marketplaces/src/InformationRegisters/рар_мп_Wildberries_СопоставленныеТовары/рар_мп_Wildberries_СопоставленныеТовары.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>рар_мп_Wildberries_СопоставленныеТовары</name>
  <resources>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </resources>
  <resources>
    <name>Характеристика</name>
    <type>
      <types>CatalogRef.ХарактеристикиНоменклатуры</types>
    </type>
  </resources>
  <resources>
    <name>Упаковка</name>
    <type>
      <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
    </type>
  </resources>
  <attributes>
    <name>Размер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеТовара</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>IDРазмера</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>30</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВозможностьСменыЦенДляРазмеров</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <dimensions>
    <name>Аккаунт</name>
    <type>
      <types>CatalogRef.рар_мп_АккаунтыМаркетплейсов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>IDТовара</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>30</precision>
      </numberQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Артикул</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Баракод</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

UT_Marketplaces.Marketplaces/src/Enums/рар_мп_Маркетплейсы/рар_мп_Маркетплейсы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>рар_мп_Маркетплейсы</name>
  <enumValues>
    <name>OZON</name>
  </enumValues>
  <enumValues>
    <name>ЯндексМаркет</name>
  </enumValues>
  <enumValues>
    <name>Wildberries</name>
  </enumValues>
</mdclass:Enum>

UT_Marketplaces.Marketplaces/src/DataProcessors/рар_мп_ПодготовкаФайловПоставки_ПодборНоменклатуры/Forms/ФормаПодбора/Module.bsl
#Область СлужебныеПроцедурыИФункцииДляПроверкиПЛС

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Если ПриПовторномОткрытииНаСервере() = Ложь Тогда
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = НСтр("ru='Вы не приняли лицензионное соглашение 1С-Рарус, функционал расширения не доступен'");
		Сообщение.Сообщить();
		ЭтотОбъект.Закрыть();
	КонецЕсли;
КонецПроцедуры

&НаСервере
Функция ПриПовторномОткрытииНаСервере()
	Возврат Константы.рар_мп_Согласие.Получить();
КонецФункции

&НаКлиенте
Процедура ПриПовторномОткрытии()
	Если ПриПовторномОткрытииНаСервере() = Ложь Тогда
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = НСтр("ru='Вы не приняли лицензионное соглашение 1С-Рарус, функционал расширения не доступен'");
		Сообщение.Сообщить();
		ЭтотОбъект.Закрыть();
	КонецЕсли;
КонецПроцедуры  

#КонецОбласти

#Область ПрочиеПроцедурыИФункции
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Аккаунт = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Параметры.Аккаунт, "Маркетплейс");
	
	Запрос = Новый Запрос; 
	
	Если Аккаунт = Перечисления.рар_мп_Маркетплейсы.OZON Тогда
		
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	рар_мп_Ozon_СопоставленныеТовары.Аккаунт КАК Аккаунт,
		|	рар_мп_Ozon_СопоставленныеТовары.Артикул КАК Артикул,
		|	рар_мп_Ozon_СопоставленныеТовары.Номенклатура КАК Номенклатура,
		|	рар_мп_Ozon_СопоставленныеТовары.Характеристика КАК Характеристика,
		|	рар_мп_Ozon_СопоставленныеТовары.Упаковка КАК Упаковка,
		|	рар_мп_Ozon_СопоставленныеТовары.НаименованиеТовара КАК НаименованиеТовара,
		|	ТоварыНаСкладахОстатки.ВНаличииОстаток КАК КоличествоОстаток
		|ИЗ
		|	РегистрСведений.рар_мп_Ozon_СопоставленныеТовары КАК рар_мп_Ozon_СопоставленныеТовары
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыНаСкладах.Остатки(, Склад = &Склад) КАК ТоварыНаСкладахОстатки
		|		ПО рар_мп_Ozon_СопоставленныеТовары.Номенклатура = ТоварыНаСкладахОстатки.Номенклатура
		|			И рар_мп_Ozon_СопоставленныеТовары.Характеристика = ТоварыНаСкладахОстатки.Характеристика
		|ГДЕ
		|	рар_мп_Ozon_СопоставленныеТовары.Аккаунт = &Аккаунт";      
		
	ИначеЕсли Аккаунт = Перечисления.рар_мп_Маркетплейсы.ЯндексМаркет Тогда
		
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	рар_мп_ЯндексМаркет_СопоставленныеТовары.Аккаунт КАК Аккаунт,
		|	рар_мп_ЯндексМаркет_СопоставленныеТовары.Артикул КАК Артикул,
		|	рар_мп_ЯндексМаркет_СопоставленныеТовары.Номенклатура КАК Номенклатура,
		|	рар_мп_ЯндексМаркет_СопоставленныеТовары.Характеристика КАК Характеристика,
		|	рар_мп_ЯндексМаркет_СопоставленныеТовары.Упаковка КАК Упаковка,
		|	рар_мп_ЯндексМаркет_СопоставленныеТовары.НаименованиеТовара КАК НаименованиеТовара,
		|	ТоварыНаСкладахОстатки.ВНаличииОстаток КАК КоличествоОстаток
		|ИЗ
		|	РегистрСведений.рар_мп_ЯндексМаркет_СопоставленныеТовары КАК рар_мп_ЯндексМаркет_СопоставленныеТовары
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыНаСкладах.Остатки(, Склад = &Склад) КАК ТоварыНаСкладахОстатки
		|		ПО рар_мп_ЯндексМаркет_СопоставленныеТовары.Номенклатура = ТоварыНаСкладахОстатки.Номенклатура
		|			И рар_мп_ЯндексМаркет_СопоставленныеТовары.Характеристика = ТоварыНаСкладахОстатки.Характеристика
		|ГДЕ
		|	рар_мп_ЯндексМаркет_СопоставленныеТовары.Аккаунт = &Аккаунт";       
		
		
		
	ИначеЕсли Аккаунт = Перечисления.рар_мп_Маркетплейсы.Wildberries Тогда
		
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	рар_мп_Wildberries_СопоставленныеТовары.Аккаунт КАК Аккаунт,
		|	рар_мп_Wildberries_СопоставленныеТовары.Баракод КАК Артикул,
		|	рар_мп_Wildberries_СопоставленныеТовары.Номенклатура КАК Номенклатура,
		|	рар_мп_Wildberries_СопоставленныеТовары.Характеристика КАК Характеристика,
		|	рар_мп_Wildberries_СопоставленныеТовары.Упаковка КАК Упаковка,
		|	рар_мп_Wildberries_СопоставленныеТовары.НаименованиеТовара КАК НаименованиеТовара,
		|	ЕСТЬNULL(ТоварыНаСкладахОстатки.ВНаличииОстаток, 0) КАК КоличествоОстаток
		|ИЗ
		|	РегистрСведений.рар_мп_Wildberries_СопоставленныеТовары КАК рар_мп_Wildberries_СопоставленныеТовары
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыНаСкладах.Остатки(, Склад = &Склад) КАК ТоварыНаСкладахОстатки
		|		ПО рар_мп_Wildberries_СопоставленныеТовары.Номенклатура = ТоварыНаСкладахОстатки.Номенклатура
		|			И рар_мп_Wildberries_СопоставленныеТовары.Характеристика = ТоварыНаСкладахОстатки.Характеристика
		|ГДЕ
		|	рар_мп_Wildberries_СопоставленныеТовары.Аккаунт = &Аккаунт";    
		
		
	КонецЕсли;     
	
	Для Каждого СтрокаТоваров Из Параметры.СписокТоваров.Выгрузить() Цикл
		
		НоваяСтрока = Объект.ВыбранныеТовары.Добавить();     
		
		Если ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Параметры.Аккаунт, "Маркетплейс") = Перечисления.рар_мп_Маркетплейсы.Wildberries Тогда
			НоваяСтрока.Артикул = СтрокаТоваров.рар_мп_Баркод;    
		ИначеЕсли ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Параметры.Аккаунт, "Маркетплейс") = Перечисления.рар_мп_Маркетплейсы.OZON Тогда 
			НоваяСтрока.Артикул = СтрокаТоваров.рар_мп_Артикул;
		КонецЕсли;
		НоваяСтрока.Номенклатура   = СтрокаТоваров.рар_мп_Номенклатура;
		НоваяСтрока.Характеристика = СтрокаТоваров.рар_мп_Характеристика;
		НоваяСтрока.Упаковка       = СтрокаТоваров.рар_мп_Упаковка;
		НоваяСтрока.Количество     = СтрокаТоваров.рар_мп_Количество;
		
	КонецЦикла; 
	
	
	Запрос.УстановитьПараметр("Аккаунт", Параметры.Аккаунт);
	Запрос.УстановитьПараметр("Склад", Параметры.Склад); 
	
	РезультатЗапроса = Запрос.Выполнить();   
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл       
		
		СтруктураОтбора = Новый Структура;
		СтруктураОтбора.Вставить("Артикул", ВыборкаДетальныеЗаписи.Артикул);
		СтруктураОтбора.Вставить("Номенклатура", ВыборкаДетальныеЗаписи.Номенклатура);
		СтруктураОтбора.Вставить("Характеристика", ВыборкаДетальныеЗаписи.Характеристика);
		СтруктураОтбора.Вставить("Упаковка", ВыборкаДетальныеЗаписи.Упаковка);

		НоваяСтрока = Объект.Номенклатура.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, ВыборкаДетальныеЗаписи);	  
		НайденнаяСтрока = Объект.ВыбранныеТовары.НайтиСтроки(СтруктураОтбора); 
		
		Для каждого Строка Из НайденнаяСтрока Цикл
		
			Если Строка <> Неопределено Тогда
			
				НоваяСтрока.КоличествоОстаток = НоваяСтрока.КоличествоОстаток - Строка.Количество;
			
			КонецЕсли;
		
		КонецЦикла;
		НоваяСтрока.КоличествоОстатокОбщее = ВыборкаДетальныеЗаписи.КоличествоОстаток;
		
	КонецЦикла;            	
	
	Если ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Параметры.Аккаунт, "Маркетплейс") = Перечисления.рар_мп_Маркетплейсы.Wildberries Тогда
		
		Элементы.Номенклатура.ПодчиненныеЭлементы.НоменклатураАртикул.Заголовок = "Баркод";
		Элементы.ВыбранныеТовары.ПодчиненныеЭлементы.ВыбранныеТоварыАртикул.Заголовок = "Баркод";
		
	КонецЕсли; 
	
КонецПроцедуры      

&НаКлиенте
Процедура ВыбранныеТоварыКоличествоПриИзменении(Элемент)
	
	ТекущаяСтрока = Элементы.ВыбранныеТовары.ТекущиеДанные;   
	
	СтруктураВыбранныеТовары = Новый Структура();         
	СтруктураВыбранныеТовары.Вставить("Артикул", ТекущаяСтрока.Артикул);
	СтруктураВыбранныеТовары.Вставить("Номенклатура", ТекущаяСтрока.Номенклатура);
	СтруктураВыбранныеТовары.Вставить("Упаковка", ТекущаяСтрока.Упаковка);
	СтруктураВыбранныеТовары.Вставить("Характеристика", ТекущаяСтрока.Характеристика);  

	СтрокаДляВосстановления = Объект.Номенклатура.НайтиСтроки(СтруктураВыбранныеТовары);  
	
	Для каждого Строка Из СтрокаДляВосстановления Цикл                     
		
		Если ТекущаяСтрока.Количество > Строка.КоличествоОстатокОбщее Тогда
		
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = "Попытка ввести количество больше, чем есть на складе.";
			Сообщение.Сообщить();   
			
		Иначе
			
			Строка.КоличествоОстаток = Строка.КоличествоОстатокОбщее - ТекущаяСтрока.Количество;
			
		КонецЕсли;
	
		
	КонецЦикла;
		
КонецПроцедуры

#КонецОбласти

#Область ОбработкаКнопкиЗаврешитьПодбор
&НаКлиенте
Процедура ЗаврешитьПодбор(Команда) 
	
	ЗавершитьПодбор = Истина;
	
	Для каждого Товар Из Объект.ВыбранныеТовары Цикл
	
		СтруктураОтбора = Новый Структура;
		СтруктураОтбора.Вставить("Артикул", Товар.Артикул);
		СтруктураОтбора.Вставить("Номенклатура", Товар.Номенклатура);
		СтруктураОтбора.Вставить("Упаковка", Товар.Упаковка);
		СтруктураОтбора.Вставить("Характеристика", Товар.Характеристика);  
		
		НайденныеТовары = Объект.Номенклатура.НайтиСтроки(СтруктураОтбора);
		
		Для каждого Номенклатура Из НайденныеТовары Цикл
		
			Если Номенклатура.КоличествоОстатокОбщее < Товар.Количество Тогда
			
				Сообщение = Новый СообщениеПользователю;
				Сообщение.Текст = СтрШаблон("Количество выбранного товара %1 (%2 с характеристикой %3) превышает остаток на складе (%4). Пожалуйста, измените количество данного товара.", 
									Номенклатура.Номенклатура, Номенклатура.Артикул, Номенклатура.Характеристика, Номенклатура.КоличествоОстатокОбщее);
				Сообщение.Сообщить();    
				
				ЗавершитьПодбор = Ложь;
			
			КонецЕсли;
		
		КонецЦикла;	
	КонецЦикла;       
	
	Если ЗавершитьПодбор Тогда
	
		АдресВХ = ЗаврешитьПодборНаСервере();  
		
		ВладелецФормы.ОбработатьПодбор(АдресВХ);
		
		Закрыть();

	
	КонецЕсли;
	
КонецПроцедуры  

&НаСервере
Функция ЗаврешитьПодборНаСервере()
	
	Возврат ПоместитьВоВременноеХранилище(объект.ВыбранныеТовары.Выгрузить());
	
КонецФункции

#КонецОбласти  

#Область ДобавлениеДанныхВТЧВыбранныеТовары

&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь; 
	МассивВыбранныхСтрок = Элементы.Номенклатура.ВыделенныеСтроки;
	ЗаполнитьТЧВыбранныеТовары(МассивВыбранныхСтрок);
	
КонецПроцедуры  

&НаКлиенте
Процедура ЗаполнитьТЧВыбранныеТовары(МассивВыбранныхСтрок)
	
	Для каждого Строка из МассивВыбранныхСтрок Цикл 
		
		НужныеСтроки = Элементы.Номенклатура.ДанныеСтроки(Строка);
		
		СтруктураВыбранныеТовары = Новый Структура();         
		СтруктураВыбранныеТовары.Вставить("Артикул", НужныеСтроки.Артикул);
		СтруктураВыбранныеТовары.Вставить("Номенклатура", НужныеСтроки.Номенклатура);
		СтруктураВыбранныеТовары.Вставить("Упаковка", НужныеСтроки.Упаковка);
		СтруктураВыбранныеТовары.Вставить("Характеристика", НужныеСтроки.Характеристика);  
		
		МассивНоменклатуры = Объект.Номенклатура.НайтиСтроки(СтруктураВыбранныеТовары);
		
		Если Объект.ВыбранныеТовары.НайтиСтроки(СтруктураВыбранныеТовары).Количество() = 0 Тогда
			
			Если НужныеСтроки.КоличествоОстаток > 0 Тогда
				
				НоваяСтрока                = Объект.ВыбранныеТовары.Добавить();
				НоваяСтрока.Артикул        = НужныеСтроки.Артикул;
				НоваяСтрока.Номенклатура   = НужныеСтроки.Номенклатура; 
				НоваяСтрока.Упаковка       = НужныеСтроки.Упаковка;
				НоваяСтрока.Характеристика = НужныеСтроки.Характеристика;
				НоваяСтрока.Количество     = 1;   
				
				Для каждого Товар Из МассивНоменклатуры Цикл
				
					Товар.КоличествоОстаток = Товар.КоличествоОстаток - 1;
				
				КонецЦикла;   
				
			Иначе
				
				Сообщение = Новый СообщениеПользователю;
				Сообщение.Текст = "Попытка перенести товар с нулевым остатком на складе.";
				Сообщение.Сообщить();

			КонецЕсли;
			
		Иначе
			
			МассивВыбранных = Объект.ВыбранныеТовары.НайтиСтроки(СтруктураВыбранныеТовары);
			
			Если НужныеСтроки.КоличествоОстаток > 0 Тогда
			
				Для каждого Товар из МассивВыбранных Цикл
					
					Товар.Количество = Товар.Количество + 1;
					
				КонецЦикла;                                                                    
				
				Для каждого Товар Из МассивНоменклатуры Цикл
					
					Товар.КоличествоОстаток = Товар.КоличествоОстаток - 1;
					
				КонецЦикла;
				
			Иначе
				
				Сообщение = Новый СообщениеПользователю;
				Сообщение.Текст = "Попытка перенести товар с нулевым остатком на складе.";
				Сообщение.Сообщить();

			КонецЕсли;						
			
		КонецЕсли;  
		
	КонецЦикла;
	
КонецПроцедуры  

&НаКлиенте
Процедура ВыбранныеТоварыПеретаскивание(Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка, Строка, Поле)
	
	МассивВыбранныхСтрок = Элементы.Номенклатура.ВыделенныеСтроки;
	ЗаполнитьТЧВыбранныеТовары(МассивВыбранныхСтрок)
	
КонецПроцедуры

#КонецОбласти

#Область УдалениеИзТЧ

&НаКлиенте
Процедура УдалениеНоменклатуры(Команда)
	
	Оповещение   = Новый ОписаниеОповещения("ОчиститьЗавершение", ЭтотОбъект);		
	ТекстВопроса = НСтр("ru = 'Вы уверены, что хотите удалить номенклатуру? 
	|Продолжить?'");							 
	ПоказатьВопрос(Оповещение, ТекстВопроса, РежимДиалогаВопрос.ДаНет, , КодВозвратаДиалога.Нет);   
	
КонецПроцедуры 

&НаКлиенте
Процедура ОчиститьЗавершение(Ответ, ДополнительныеПараметры) Экспорт 
	
	Если Ответ <> КодВозвратаДиалога.Да Тогда 
		Возврат;
	КонецЕсли;    
	
	МассивУдаляемыхСтрок = Элементы.ВыбранныеТовары.ВыделенныеСтроки; 
	КоличествоСтрок 	 = МассивУдаляемыхСтрок.Количество(); 
	
	Пока КоличествоСтрок > 0 Цикл
		НайденнаяСтрока = Объект.ВыбранныеТовары.НайтиПоИдентификатору(МассивУдаляемыхСтрок[КоличествоСтрок - 1]);
		Объект.ВыбранныеТовары.Удалить(НайденнаяСтрока); 
		КоличествоСтрок = КоличествоСтрок - 1;       
		
		СтруктураВыбранныеТовары = Новый Структура();         
		СтруктураВыбранныеТовары.Вставить("Артикул", НайденнаяСтрока.Артикул);
		СтруктураВыбранныеТовары.Вставить("Номенклатура", НайденнаяСтрока.Номенклатура);
		СтруктураВыбранныеТовары.Вставить("Упаковка", НайденнаяСтрока.Упаковка);
		СтруктураВыбранныеТовары.Вставить("Характеристика", НайденнаяСтрока.Характеристика);  

		СтрокаДляВосстановления = Объект.Номенклатура.НайтиСтроки(СтруктураВыбранныеТовары);   
		
		Для каждого Строка Из СтрокаДляВосстановления Цикл
		
			Строка.КоличествоОстаток = Строка.КоличествоОстаток + НайденнаяСтрока.Количество;
		
		КонецЦикла;
	КонецЦикла; 
	
КонецПроцедуры

#КонецОбласти
